УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b318cc3-2f5c-4b35-9733-92b8480d218b">
    <name>смартЛогинНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45c407b4-0b68-47cd-a142-a06f4a184f90">
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеренесеноСДоработками

//++#1605 смарт: Лопато 29.01.2024 //Доработки по интернет-магазину
&Перед("ПередЗаписью")
Процедура смарт_ПередЗаписьюПеред(Отказ)
	
	//++#1605 смарт: Лопато 29.01.2024 //Доработки по интернет-магазину
	смартОбщегоНазначения.смартЗаполнитьФИОКонтактногоЛицаПартнера(ЭтотОбъект);
	//--#1605 смарт: Лопато 29.01.2024
	
КонецПроцедуры

//++ #Б-2464 смарт: Лопато 21.02.2025 //Исправить заполнение полей при копировании Контактного лица  
&Перед("ПриКопировании")
Процедура смарт_ПриКопировании(ОбъектКопирования)
	
	//++ #Б-2464 смарт: Лопато 21.02.2025 //Исправить заполнение полей при копировании Контактного лица  
	смартЛогинНаСайте 			 = Неопределено;
	смартТелефонНаСайте 		 = Неопределено;
	смартЭлектроннаяПочтаНаСайте = Неопределено;
	//-- #Б-2464 смарт: Лопато 21.02.2025
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552 проверка контактного лица на дубль смартЛогинНаСайте
&Вместо("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КлючДанных = ?(ТипЗнч(ЭтотОбъект) = Тип("ФормаКлиентскогоПриложения"), Неопределено, ЭтотОбъект);
	Если ЗначениеЗаполнено(ЭтотОбъект.смартЛогинНаСайте) Тогда 
		
		ВыборкаКонтакт = смартЛогинУжеИспользуетсяВИнформационнойБазе(ЭтотОбъект.смартЛогинНаСайте, Ссылка);
		
		Если ВыборкаКонтакт <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//++#1256 смарт: Лопато 03.06.2024 //Изменить проверку на дубли email при вводе в Контактном лице (продолжение задачи 1012)  
			НСтр("ru='Данный Логин на сайте уже указан для контактного лица %1, ответственный %2.'"),
			ВыборкаКонтакт.Ссылка,
			ВыборкаКонтакт.Автор),
			//--#1256 смарт: Лопато 03.06.2024
			КлючДанных,
			"смартЛогинНаСайте",
			,
			Отказ);
			
		КонецЕсли;
						
	//Иначе
	//	
	//	Если НЕ смартУпрощенныйВводДоступен() Тогда
	//		
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		НСтр("ru = 'Не указан Логин на сайте'"),
	//		КлючДанных,
	//		"смартЛогинНаСайте",
	//		,
	//		Отказ);
	//		
	//	КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552
Функция смартЛогинУжеИспользуетсяВИнформационнойБазе(Логин,ИсключаяСсылку = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
	|	КонтактныеЛицаПартнеров.Автор КАК Автор
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.смартЛогинНаСайте = &Логин
	|	И КонтактныеЛицаПартнеров.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Логин",Логин);
	Запрос.УстановитьПараметр("Ссылка",ИсключаяСсылку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552
Функция смартУпрощенныйВводДоступен() Экспорт
	
	Возврат ПравоДоступа("Добавление", Метаданные.Справочники.КонтактныеЛицаПартнеров) И смартВводИнформацииПоКонтактномуЛицуБезКонтроля();
	
КонецФункции

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 23.08.2021 10:27:52 задача 552
Функция смартВводИнформацииПоКонтактномуЛицуБезКонтроля(Пользователь = Неопределено) Экспорт
	
	Возврат Пользователи.РолиДоступны("смартВводИнформацииПоКонтактномуЛицуБезКонтроля", Пользователь, Ложь);
	
КонецФункции

#КонецЕсли
